{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "68"}]}}}, "outputs": {"time_distributed": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "68"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "384"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/unstack-folded-0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "384"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/unstack-folded-1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "192"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/unstack-folded-0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "192"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/unstack-folded-1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/unstack-folded-0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "192"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/unstack-folded-1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "68"}, {"size": "384"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/unstack-folded-0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "384"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/unstack-folded-1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/repeat_vector/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/repeat_vector/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/time_distributed/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/time_distributed/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "68"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/time_distributed/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "68"}]}}}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/time_distributed/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "68"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/enter/_244", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_3/Read/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8zL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/enter/_245", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/unstack-folded-0"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8zL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/enter/_246", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_3/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8zL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/enter/_247", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/unstack-folded-1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8zL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/enter/_239", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8zL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/enter/_184", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_2/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8yL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/enter/_185", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/unstack-folded-0"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8yL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/enter/_186", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_2/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8yL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/enter/_187", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/unstack-folded-1"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8yL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/enter/_179", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8yL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/enter/_124", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_1/Read/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/enter/_125", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/unstack-folded-0"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/enter/_126", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_1/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/enter/_127", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/unstack-folded-1"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/enter/_119", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/time"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_64", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/Read/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_65", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/unstack-folded-0"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_66", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/Read_1/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_67", "op": "Enter", "input": ["ConstantFolding/StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/unstack-folded-1"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_59", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_57", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/enter/_117", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/enter/_177", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/loop_counter"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8yL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/enter/_237", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8zL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/Shape", "op": "Shape", "input": ["input_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/transpose", "op": "Transpose", "input": ["input_1", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/merge/_255", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/enter/_244", "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/next_iteration/_291"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/merge/_256", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/enter/_245", "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/next_iteration/_292"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/merge/_257", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/enter/_246", "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/next_iteration/_293"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/merge/_258", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/enter/_247", "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/next_iteration/_294"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/merge/_250", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/enter/_239", "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/next_iteration/_286"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/merge/_195", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/enter/_184", "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/next_iteration/_231"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/merge/_196", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/enter/_185", "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/next_iteration/_232"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/merge/_197", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/enter/_186", "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/next_iteration/_233"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/merge/_198", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/enter/_187", "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/next_iteration/_234"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/merge/_190", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/enter/_179", "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/next_iteration/_226"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/enter/_120", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/TensorArrayV2_1"], "attr": {"T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/merge/_135", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/enter/_124", "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/next_iteration/_171"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/merge/_136", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/enter/_125", "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/next_iteration/_172"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/merge/_137", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/enter/_126", "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/next_iteration/_173"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/merge/_138", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/enter/_127", "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/next_iteration/_174"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/merge/_130", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/enter/_119", "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/next_iteration/_166"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_75", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_64", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/next_iteration/_111"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_76", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_65", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/next_iteration/_112"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_77", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_66", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/next_iteration/_113"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_78", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_67", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/next_iteration/_114"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_70", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_59", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/next_iteration/_106"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_68", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_57", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/next_iteration/_104"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/merge/_128", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/enter/_117", "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/next_iteration/_164"], "attr": {"_has_manual_control_dependencies": {"b": true}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/merge/_188", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/enter/_177", "StatefulPartitionedCall/gru_autoencoder/gru_2/PartitionedCall/while/next_iteration/_224"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/merge/_248", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/enter/_237", "StatefulPartitionedCall/gru_autoencoder/gru_3/PartitionedCall/while/next_iteration/_284"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/Shape", "StatefulPartitionedCall/gru_autoencoder/gru/strided_slice/stack", "StatefulPartitionedCall/gru_autoencoder/gru/strided_slice/stack_1", "StatefulPartitionedCall/gru_autoencoder/gru/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/transpose", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/merge/_131", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/enter/_120", "StatefulPartitionedCall/gru_autoencoder/gru_1/PartitionedCall/while/next_iteration/_167"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/strided_slice", "StatefulPartitionedCall/gru_autoencoder/gru/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_63", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/Shape", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/zeros/packed", "StatefulPartitionedCall/gru_autoencoder/gru/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_74", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_63", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/next_iteration/_110"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_62", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/strided_slice"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_61", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/zeros"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_60", "op": "Enter", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/TensorArrayV2_1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZ3J1X2F1dG9lbmNvZGVyL2dydS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_73", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_62", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/next_iteration/_109"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_72", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_61", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/next_iteration/_108"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_71", "op": "Merge", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/enter/_60", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/next_iteration/_107"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/cond/_55/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_70", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_73", "^StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_68"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/LoopCond/_79", "op": "LoopCond", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/cond/_55/while/Less"]}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_86", "op": "Switch", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_74", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/LoopCond/_79"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/Func/StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/input/_21_switch/_87", "op": "Switch", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_75", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/LoopCond/_79"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/unstack_switch/_88", "op": "Switch", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_76", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/LoopCond/_79"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/Func/StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/input/_20_switch/_84", "op": "Switch", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_72", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/LoopCond/_79"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/Func/StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/input/_22_switch/_89", "op": "Switch", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_77", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/LoopCond/_79"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/unstack_switch/_90", "op": "Switch", "input": ["StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/merge/_78", "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/LoopCond/_79"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/while/StatefulPartitionedCall/gru_autoencoder/gru/PartitionedCall/time_switch/_82", "op": "Switch", "input": 